MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0AVMI15/mcu.h
#define PDB0_SC                       (*((volatile uint32_t *)0x40036000))      // Status and Control register
#define PDB0_MOD                      (*((volatile uint32_t *)0x40036004))      // Modulus register
#define PDB0_CNT                      (*((volatile uint32_t *)0x40036008))      // Counter register
#define PDB0_IDLY                     (*((volatile uint32_t *)0x4003600C))      // Interrupt Delay register
#define PDB0_CH0C1                    (*((volatile uint32_t *)0x40036010))      // Channel n Control register 1
#define PDB0_CH0S                     (*((volatile uint32_t *)0x40036014))      // Channel n Status register
#define PDB0_CH0DLY0                  (*((volatile uint32_t *)0x40036018))      // Channel n Delay 0 register
#define PDB0_CH0DLY1                  (*((volatile uint32_t *)0x4003601C))      // Channel n Delay 1 register
#define PDB0_DACINTC0                 (*((volatile uint32_t *)0x40036150))      // DAC Interval Trigger n Control register
#define PDB0_DACINT0                  (*((volatile uint32_t *)0x40036154))      // DAC Interval n register
#define PDB0_POEN                     (*((volatile uint32_t *)0x40036190))      // Pulse-Out n Enable register
#define PDB0_PO0DLY                   (*((volatile uint32_t *)0x40036194))      // Pulse-Out n Delay register
#define PDB0_PO1DLY                   (*((volatile uint32_t *)0x40036198))      // Pulse-Out n Delay register


//*****************************************************************************
//
// Periodic Interrupt Timer (PIT) registers
//
//*****************************************************************************

#define PIT0_MCR                      (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register
#define PIT0_LTMR64H                  (*((volatile uint32_t *)0x400370E0))      // PIT Upper Lifetime Timer Register
#define PIT0_LTMR64L                  (*((volatile uint32_t *)0x400370E4))      // PIT Lower Lifetime Timer Register
#define PIT0_LDVAL0                   (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register
#define PIT0_CVAL0                    (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register
#define PIT0_TCTRL0                   (*((volatile uint32_t *)0x40037108))      // Timer Control Register
#define PIT0_TFLG0                    (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register
#define PIT0_LDVAL1                   (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register
#define PIT0_CVAL1                    (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register
#define PIT0_TCTRL1                   (*((volatile uint32_t *)0x40037118))      // Timer Control Register
#define PIT0_TFLG1                    (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register
#define PIT0_LDVAL2                   (*((volatile uint32_t *)0x40037120))      // Timer Load Value Register
#define PIT0_CVAL2                    (*((volatile uint32_t *)0x40037124))      // Current Timer Value Register
#define PIT0_TCTRL2                   (*((volatile uint32_t *)0x40037128))      // Timer Control Register
#define PIT0_TFLG2                    (*((volatile uint32_t *)0x4003712C))      // Timer Flag Register
#define PIT0_LDVAL3                   (*((volatile uint32_t *)0x40037130))      // Timer Load Value Register
#define PIT0_CVAL3                    (*((volatile uint32_t *)0x40037134))      // Current Timer Value Register
#define PIT0_TCTRL3                   (*((volatile uint32_t *)0x40037138))      // Timer Control Register
#define PIT0_TFLG3                    (*((volatile uint32_t *)0x4003713C))      // Timer Flag Register


//*****************************************************************************
//
// Real Time Clock (RTC) registers
//
//*****************************************************************************

#define RTC_TSR                       (*((volatile uint32_t *)0x4003D000))      // RTC Time Seconds Register
#define RTC_TPR                       (*((volatile uint32_t *)0x4003D004))      // RTC Time Prescaler Register
#define RTC_TAR                       (*((volatile uint32_t *)0x4003D008))      // RTC Time Alarm Register
#define RTC_TCR                       (*((volatile uint32_t *)0x4003D00C))      // RTC Time Compensation Register
#define RTC_CR                        (*((volatile uint32_t *)0x4003D010))      // RTC Control Register
#define RTC_SR                        (*((volatile uint32_t *)0x4003D014))      // RTC Status Register
#define RTC_LR                        (*((volatile uint32_t *)0x4003D018))      // RTC Lock Register
#define RTC_IER                       (*((volatile uint32_t *)0x4003D01C))      // RTC Interrupt Enable Register
#define RTC_WAR                       (*((volatile uint32_t *)0x4003D800))      // RTC Write Access Register
#define RTC_RAR                       (*((volatile uint32_t *)0x4003D804))      // RTC Read Access Register


//*****************************************************************************
//
// Universal Serial Bus Full Speed OTG Controller (USBFSOTG) registers
//
//*****************************************************************************

#define USB0_PERID                    (*((volatile uint32_t *)0x40072000))      // Peripheral ID register (USB0_PERID)
#define USB0_IDCOMP                   (*((volatile uint32_t *)0x40072004))      // Peripheral ID Complement register (USB0_IDCOMP)
#define USB0_REV                      (*((volatile uint32_t *)0x40072008))      // Peripheral Revision register (USB0_REV)
#define USB0_ADDINFO                  (*((volatile uint32_t *)0x4007200C))      // Peripheral Additional Info register (USB0_ADDINFO)
#define USB0_OTGISTAT                 (*((volatile uint32_t *)0x40072010))      // OTG Interrupt Status register (USB0_OTGISTAT)
#define USB0_OTGICR                   (*((volatile uint32_t *)0x40072014))      // OTG Interrupt Control register (USB0_OTGICR)
#define USB0_OTGSTAT                  (*((volatile uint32_t *)0x40072018))      // OTG Status register (USB0_OTGSTAT)
#define USB0_OTGCTL                   (*((volatile uint32_t *)0x4007201C))      // OTG Control register (USB0_OTGCTL)
#define USB0_ISTAT                    (*((volatile uint32_t *)0x40072080))      // Interrupt Status register (USB0_ISTAT)
#define USB0_INTEN                    (*((volatile uint32_t *)0x40072084))      // Interrupt Enable register (USB0_INTEN)
#define USB0_ERRSTAT                  (*((volatile uint32_t *)0x40072088))      // Error Interrupt Status register (USB0_ERRSTAT)
#define USB0_ERREN                    (*((volatile uint32_t *)0x4007208C))      // Error Interrupt Enable register (USB0_ERREN)
#define USB0_STAT                     (*((volatile uint32_t *)0x40072090))      // Status register (USB0_STAT)
#define USB0_CTL                      (*((volatile uint32_t *)0x40072094))      // Control register (USB0_CTL)
#define USB0_ADDR                     (*((volatile uint32_t *)0x40072098))      // Address register (USB0_ADDR)
#define USB0_BDTPAGE1                 (*((volatile uint32_t *)0x4007209C))      // BDT Page register 1 (USB0_BDTPAGE1)
#define USB0_FRMNUML                  (*((volatile uint32_t *)0x400720A0))      // Frame Number register Low (USB0_FRMNUML)
#define USB0_FRMNUMH                  (*((volatile uint32_t *)0x400720A4))      // Frame Number register High (USB0_FRMNUMH)
#define USB0_TOKEN                    (*((volatile uint32_t *)0x400720A8))      // Token register (USB0_TOKEN)
#define USB0_SOFTHLD                  (*((volatile uint32_t *)0x400720AC))      // SOF Threshold register (USB0_SOFTHLD)
#define USB0_BDTPAGE2                 (*((volatile uint32_t *)0x400720B0))      // BDT Page Register 2 (USB0_BDTPAGE2)
#define USB0_BDTPAGE3                 (*((volatile uint32_t *)0x400720B4))      // BDT Page Register 3 (USB0_BDTPAGE3)
#define USB0_ENDPT0                   (*((volatile uint32_t *)0x400720C0))      // Endpoint Control register (USB0_ENDPT0)
#define USB0_ENDPT1                   (*((volatile uint32_t *)0x400720C4))      // Endpoint Control register (USB0_ENDPT1)
#define USB0_ENDPT2                   (*((volatile uint32_t *)0x400720C8))      // Endpoint Control register (USB0_ENDPT2)
#define USB0_ENDPT3                   (*((volatile uint32_t *)0x400720CC))      // Endpoint Control register (USB0_ENDPT3)
#define USB0_ENDPT4                   (*((volatile uint32_t *)0x400720D0))      // Endpoint Control register (USB0_ENDPT4)
#define USB0_ENDPT5                   (*((volatile uint32_t *)0x400720D4))      // Endpoint Control register (USB0_ENDPT5)
#define USB0_ENDPT6                   (*((volatile uint32_t *)0x400720D8))      // Endpoint Control register (USB0_ENDPT6)
#define USB0_ENDPT7                   (*((volatile uint32_t *)0x400720DC))      // Endpoint Control register (USB0_ENDPT7)
#define USB0_ENDPT8                   (*((volatile uint32_t *)0x400720E0))      // Endpoint Control register (USB0_ENDPT8)
#define USB0_ENDPT9                   (*((volatile uint32_t *)0x400720E4))      // Endpoint Control register (USB0_ENDPT9)
#define USB0_ENDPT10                  (*((volatile uint32_t *)0x400720E8))      // Endpoint Control register (USB0_ENDPT10)
#define USB0_ENDPT11                  (*((volatile uint32_t *)0x400720EC))      // Endpoint Control register (USB0_ENDPT11)
#define USB0_ENDPT12                  (*((volatile uint32_t *)0x400720F0))      // Endpoint Control register (USB0_ENDPT12)
#define USB0_ENDPT13                  (*((volatile uint32_t *)0x400720F4))      // Endpoint Control register (USB0_ENDPT13)
#define USB0_ENDPT14                  (*((volatile uint32_t *)0x400720F8))      // Endpoint Control register (USB0_ENDPT14)
#define USB0_ENDPT15                  (*((volatile uint32_t *)0x400720FC))      // Endpoint Control register (USB0_ENDPT15)
#define USB0_USBCTRL                  (*((volatile uint32_t *)0x40072100))      // USB Control register (USB0_USBCTRL)
#define USB0_OBSERVE                  (*((volatile uint32_t *)0x40072104))      // USB OTG Observe register (USB0_OBSERVE)
#define USB0_CONTROL                  (*((volatile uint32_t *)0x40072108))      // USB OTG Control register (USB0_CONTROL)
#define USB0_USBTRC0                  (*((volatile uint32_t *)0x4007210C))      // USB Transceiver Control register 0 (USB0_USBTRC0)
#define USB0_USBFRMADJUST             (*((volatile uint32_t *)0x40072114))      // Frame Adjust Register (USB0_USBFRMADJUST)
#define USB0_MISCCTRL                 (*((volatile uint32_t *)0x4007212C))      // Miscellaneous Control register (USB0_MISCCTRL)
#define USB0_CLK_RECOVER_CTRL         (*((volatile uint32_t *)0x40072140))      // USB Clock recovery control (USB0_CLK_RECOVER_CTRL)
#define USB0_CLK_RECOVER_IRC_EN       (*((volatile uint32_t *)0x40072144))      // IRC48M oscillator enable register (USB0_CLK_RECOVER_IRC_EN)
#define USB0_CLK_RECOVER_INT_EN       (*((volatile uint32_t *)0x40072154))      // Clock recovery combined interrupt enable (USB0_CLK_RECOVER_INT_EN)
#define USB0_CLK_RECOVER_INT_STATUS   (*((volatile uint32_t *)0x4007215C))      // Clock recovery separated interrupt status (USB0_CLK_RECOVER_INT_STATUS)


//*****************************************************************************
//
// USB Device Charger Detection Module (USBDCD) registers
//
//*****************************************************************************

#define USBDCD_CONTROL                (*((volatile uint32_t *)0x40035000))      // Control register
#define USBDCD_CLOCK                  (*((volatile uint32_t *)0x40035004))      // Clock register
#define USBDCD_STATUS                 (*((volatile uint32_t *)0x40035008))      // Status register
#define USBDCD_SIGNAL_OVERRIDE        (*((volatile uint32_t *)0x4003500C))      // Signal Override Register
#define USBDCD_TIMER0                 (*((volatile uint32_t *)0x40035010))      // TIMER0 register
#define USBDCD_TIMER1                 (*((volatile uint32_t *)0x40035014))      // TIMER1 register
#define USBDCD_TIMER2_BC11            (*((volatile uint32_t *)0x40035018))      // TIMER2_BC11 register
#define USBDCD_TIMER2_BC12            (*((volatile uint32_t *)0x40035018))      // TIMER2_BC12 register


//*****************************************************************************
//
// Universal Serial Bus 2.0 Integrated PHY (USB-PHY) registers
//
//*****************************************************************************

#define USBPHY_PWD                    (*((volatile uint32_t *)0x400A2000))      // USB PHY Power-Down Register (USBPHY_PWD)
#define USBPHY_PWD_SET                (*((volatile uint32_t *)0x400A2004))      // USB PHY Power-Down Register (USBPHY_PWD_SET)
#define USBPHY_PWD_CLR                (*((volatile uint32_t *)0x400A2008))      // USB PHY Power-Down Register (USBPHY_PWD_CLR)
#define USBPHY_PWD_TOG                (*((volatile uint32_t *)0x400A200C))      // USB PHY Power-Down Register (USBPHY_PWD_TOG)
#define USBPHY_TX                     (*((volatile uint32_t *)0x400A2010))      // USB PHY Transmitter Control Register (USBPHY_TX)
#define USBPHY_TX_SET                 (*((volatile uint32_t *)0x400A2014))      // USB PHY Transmitter Control Register (USBPHY_TX_SET)
#define USBPHY_TX_CLR                 (*((volatile uint32_t *)0x400A2018))      // USB PHY Transmitter Control Register (USBPHY_TX_CLR)
#define USBPHY_TX_TOG                 (*((volatile uint32_t *)0x400A201C))      // USB PHY Transmitter Control Register (USBPHY_TX_TOG)
#define USBPHY_RX                     (*((volatile uint32_t *)0x400A2020))      // USB PHY Receiver Control Register (USBPHY_RX)
#define USBPHY_RX_SET                 (*((volatile uint32_t *)0x400A2024))      // USB PHY Receiver Control Register (USBPHY_RX_SET)
#define USBPHY_RX_CLR                 (*((volatile uint32_t *)0x400A2028))      // USB PHY Receiver Control Register (USBPHY_RX_CLR)
#define USBPHY_RX_TOG                 (*((volatile uint32_t *)0x400A202C))      // USB PHY Receiver Control Register (USBPHY_RX_TOG)
#define USBPHY_CTRL                   (*((volatile uint32_t *)0x400A2030))      // USB PHY General Control Register (USBPHY_CTRL)
#define USBPHY_CTRL_SET               (*((volatile uint32_t *)0x400A2034))      // USB PHY General Control Register (USBPHY_CTRL_SET)
#define USBPHY_CTRL_CLR               (*((volatile uint32_t *)0x400A2038))      // USB PHY General Control Register (USBPHY_CTRL_CLR)
#define USBPHY_CTRL_TOG               (*((volatile uint32_t *)0x400A203C))      // USB PHY General Control Register (USBPHY_CTRL_TOG)
#define USBPHY_STATUS                 (*((volatile uint32_t *)0x400A2040))      // USB PHY Status Register (USBPHY_STATUS)
#define USBPHY_DEBUG                  (*((volatile uint32_t *)0x400A2050))      // USB PHY Debug Register (USBPHY_DEBUG)
#define USBPHY_DEBUG_SET              (*((volatile uint32_t *)0x400A2054))      // USB PHY Debug Register (USBPHY_DEBUG_SET)
#define USBPHY_DEBUG_CLR              (*((volatile uint32_t *)0x400A2058))      // USB PHY Debug Register (USBPHY_DEBUG_CLR)
#define USBPHY_DEBUG_TOG              (*((volatile uint32_t *)0x400A205C))      // USB PHY Debug Register (USBPHY_DEBUG_TOG)
#define USBPHY_DEBUG0_STATUS          (*((volatile uint32_t *)0x400A2060))      // UTMI Debug Status Register 0
#define USBPHY_DEBUG1                 (*((volatile uint32_t *)0x400A2070))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1)
#define USBPHY_DEBUG1_SET             (*((volatile uint32_t *)0x400A2074))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1_SET)
#define USBPHY_DEBUG1_CLR             (*((volatile uint32_t *)0x400A2078))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1_CLR)
#define USBPHY_DEBUG1_TOG             (*((volatile uint32_t *)0x400A207C))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1_TOG)
#define USBPHY_VERSION                (*((volatile uint32_t *)0x400A2080))      // UTMI RTL Version (USBPHY_VERSION)
#define USBPHY_PLL_SIC                (*((volatile uint32_t *)0x400A20A0))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC)
#define USBPHY_PLL_SIC_SET            (*((volatile uint32_t *)0x400A20A4))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC_SET)
#define USBPHY_PLL_SIC_CLR            (*((volatile uint32_t *)0x400A20A8))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC_CLR)
#define USBPHY_PLL_SIC_TOG            (*((volatile uint32_t *)0x400A20AC))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC_TOG)
#define USBPHY_USB1_VBUS_DETECT       (*((volatile uint32_t *)0x400A20C0))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT)
#define USBPHY_USB1_VBUS_DETECT_SET   (*((volatile uint32_t *)0x400A20C4))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT_SET)
#define USBPHY_USB1_VBUS_DETECT_CLR   (*((volatile uint32_t *)0x400A20C8))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT_CLR)
#define USBPHY_USB1_VBUS_DETECT_TOG   (*((volatile uint32_t *)0x400A20CC))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT_TOG)
#define USBPHY_USB1_VBUS_DET_STAT     (*((volatile uint32_t *)0x400A20D0))      // USB PHY VBUS Detector Status Register (USBPHY_USB1_VBUS_DET_STAT)
#define USBPHY_USB1_CHRG_DET_STAT     (*((volatile uint32_t *)0x400A20F0))      // USB PHY Charger Detect Status Register (USBPHY_USB1_CHRG_DET_STAT)
#define USBPHY_ANACTRL                (*((volatile uint32_t *)0x400A2100))      // USB PHY Analog Control Register (USBPHY_ANACTRL)
#define USBPHY_ANACTRL_SET            (*((volatile uint32_t *)0x400A2104))      // USB PHY Analog Control Register (USBPHY_ANACTRL_SET)
#define USBPHY_ANACTRL_CLR            (*((volatile uint32_t *)0x400A2108))      // USB PHY Analog Control Register (USBPHY_ANACTRL_CLR)
#define USBPHY_ANACTRL_TOG            (*((volatile uint32_t *)0x400A210C))      // USB PHY Analog Control Register (USBPHY_ANACTRL_TOG)
#define USBPHY_USB1_LOOPBACK          (*((volatile uint32_t *)0x400A2110))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK)
#define USBPHY_USB1_LOOPBACK_SET      (*((volatile uint32_t *)0x400A2114))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK_SET)
#define USBPHY_USB1_LOOPBACK_CLR      (*((volatile uint32_t *)0x400A2118))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK_CLR)
#define USBPHY_USB1_LOOPBACK_TOG      (*((volatile uint32_t *)0x400A211C))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK_TOG)
#define USBPHY_USB1_LOOPBACK_HSFSCNT  (*((volatile uint32_t *)0x400A2120))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET(*((volatile uint32_t *)0x400A2124))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT_SET)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR(*((volatile uint32_t *)0x400A2128))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT_CLR)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG(*((volatile uint32_t *)0x400A212C))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT_TOG)
#define USBPHY_TRIM_OVERRIDE_EN       (*((volatile uint32_t *)0x400A2130))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN)
#define USBPHY_TRIM_OVERRIDE_EN_SET   (*((volatile uint32_t *)0x400A2134))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN_SET)
#define USBPHY_TRIM_OVERRIDE_EN_CLR   (*((volatile uint32_t *)0x400A2138))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN_CLR)
#define USBPHY_TRIM_OVERRIDE_EN_TOG   (*((volatile uint32_t *)0x400A213C))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN_TOG)


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

