MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0AVMI15/mcu.h
#define ISF                           0x7FFFFFFF80000000      // Interrupt Status Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_DFER register.
//
//*****************************************************************************

#define DFE                           0x7FFFFFFF80000000      // Digital Filter Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_DFCR register.
//
//*****************************************************************************

#define CS                            0x00000001      // Clock Source


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define USBREGEN                      0x80000000      // USB voltage regulator enable
#define USBSSTBY                      0x40000000      // USB voltage regulator in standby mode during Stop, VLPS, LLS and VLLS modes
#define USBVSTBY                      0x20000000      // USB voltage regulator in standby mode during VLPR and VLPW modes
#define OSC32KSEL                     0x02000000      // 32K oscillator clock select
#define RAMSIZE                       0x00078000      // RAM size


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1CFG register.
//
//*****************************************************************************

#define USSWE                         0x04000000      // USB voltage regulator stop standby write enable
#define UVSWE                         0x02000000      // USB voltage regulator VLP standby write enable
#define URWE                          0x01000000      // USB voltage regulator enable write enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_USBPHYCTL register.
//
//*****************************************************************************

#define USBDISILIM                    0x00800000      // USB Disable Inrush Current Limit
#define USB3VOUTTRG                   0x01C00000      // USB 3.3V Output Target
#define USBVREGPD                     0x00000200      // Enables the pulldown on the output of the USB Regulator
#define USBVREGSEL                    0x00000100      // Selects the default input voltage source to the USB Regulator in case both VREG_IN0 and VREG_IN1 are powered


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define SDHCSRC                       0x60000000      // SDHC clock source select
#define LPUARTSRC                     0x18000000      // LPUART clock source select
#define TPMSRC                        0x06000000      // TPM clock source select
#define FLEXIOSRC                     0x01800000      // FlexIO Module Clock Source Select
#define USBSRC                        0x00040000      // USB clock source select
#define PLLFLLSEL                     0x00060000      // PLL/FLL clock select
#define TRACECLKSEL                   0x00001000      // Debug trace clock select
#define FBSL                          0x00000380      // FlexBus security level
#define RTCCLKOUTSEL                  0x00000010      // RTC clock out select
#define USBREGEN                      0x00000002      // USB PHY PLL Regulator Enable
#define USBSLSRC                      0x00000001      // USB Slow Clock Source


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

#define FTM3TRG1SRC                   0x80000000      // FlexTimer 3 Hardware Trigger 1 Source Select
#define FTM3TRG0SRC                   0x40000000      // FlexTimer 3 Hardware Trigger 0 Source Select
#define FTM0TRG1SRC                   0x20000000      // FlexTimer 0 Hardware Trigger 1 Source Select
#define FTM0TRG0SRC                   0x10000000      // FlexTimer 0 Hardware Trigger 0 Source Select
#define FTM3CLKSEL                    0x08000000      // FlexTimer 3 External Clock Pin Select
#define FTM2CLKSEL                    0x04000000      // FlexTimer 2 External Clock Pin Select
#define FTM1CLKSEL                    0x02000000      // FTM1 External Clock Pin Select
#define FTM0CLKSEL                    0x01000000      // FlexTimer 0 External Clock Pin Select
#define FTM2CH1SRC                    0x00400000      // FTM2 channel 1 input capture source select
#define FTM2CH0SRC                    0x00600000      // FTM2 channel 0 input capture source select
#define FTM1CH0SRC                    0x00180000      // FTM1 channel 0 input capture source select
#define FTM3FLT0                      0x00001000      // FTM3 Fault 0 Select
#define FTM2FLT0                      0x00000100      // FTM2 Fault 0 Select
#define FTM1FLT0                      0x00000010      // FTM1 Fault 0 Select
#define FTM0FLT1                      0x00000004      // FTM0 Fault 1 Select
#define FTM0FLT0                      0x00000001      // FTM0 Fault 0 Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT5 register.
//
//*****************************************************************************

#define LPUART1RXSRC                  0x01800000      // LPUART1 receive data source select
#define LPUART1TXSRC                  0x00600000      // LPUART1 transmit data source select
#define LPUART0RXSRC                  0x00180000      // LPUART0 receive data source select
#define LPUART0TXSRC                  0x00060000      // LPUART0 transmit data source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

