MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0AVMI15/mcu.h
#define SR                            0x02000000      // Software Reset
#define START                         0x01000000      // Start Change Detection Sequence
#define BC12                          0x00020000      // BC1.2 compatibility
#define IE                            0x00010000      // Interrupt Enable
#define IF                            0x00000100      // Interrupt Flag
#define IACK                          0x00000001      // Interrupt Acknowledge


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CLOCK register.
//
//*****************************************************************************

#define CLOCK_SPEED                   0x001FF800      // Numerical Value of Clock Speed in Binary
#define CLOCK_UNIT                    0x00000001      // Unit of Measurement Encoding for Clock Speed


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_STATUS register.
//
//*****************************************************************************

#define ACTIVE                        0x00400000      // Active Status Indicator
#define TO                            0x00200000      // Timeout Flag
#define ERR                           0x00100000      // Error Flag
#define SEQ_STAT                      0x00180000      // Charger Detection Sequence Status
#define SEQ_RES                       0x00060000      // Charger Detection Sequence Results


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_SIGNAL_OVERRIDE register.
//
//*****************************************************************************

#define PS                            0x00000006      // Phase Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER0 register.
//
//*****************************************************************************

#define TSEQ_INIT                     0x7FE000000      // Sequence Initiation Time
#define TUNITCON                      0x00078000      // Unit Connection Timer Elapse


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER1 register.
//
//*****************************************************************************

#define TDCD_DBNC                     0x7FE000000      // Time Period to Debounce D+ Signal
#define TVDPSRC_ON                    0x0007FE00      // Time Period Comparator Enabled


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER2_BC11 register.
//
//*****************************************************************************

#define TVDPSRC_CON                   0x7FE000000      // Time Period Before Enabling D+ Pullup
#define CHECK_DM                      0x00000078      // Time Before Check of D– Line


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER2_BC12 register.
//
//*****************************************************************************

#define TWAIT_AFTER_PRD               0x7FE000000      // 
#define TVDMSRC_ON                    0x0007FE00      //  ::


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_PWDn register.
//
//*****************************************************************************

#define RXPWDRX                       0x00100000      // Power-down the entire USB PHY receiver block except for the full-speed differential receiver
#define RXPWDDIFF                     0x00080000      // Power-down the USB high-speed differential receiver
#define RXPWD1PT1                     0x00040000      // Power-down the USB full-speed differential receiver
#define RXPWDENV                      0x00020000      // Power-down the USB high-speed receiver envelope detector (squelch signal)
#define TXPWDV2I                      0x00001000      // Power-down the USB PHY transmit V-to-I converter and the current mirror
#define TXPWDIBIAS                    0x00000800      // Power-down the USB PHY current bias block for the transmitter
#define TXPWDFS                       0x00000400      // Power-down the USB full-speed drivers


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_TXn register.
//
//*****************************************************************************

#define USBPHY_TX_EDGECTRL            0x70000000      // Controls the edge-rate of the current sensing transistors used in HS transmit
#define TXCAL45DP                     0x00780000      // Decode to trim the nominal 45Ω series termination resistance to the USB_DP output pin
#define TXCAL45DM                     0x00007800      // Decode to trim the nominal 45Ω series termination resistance to the USB_DM output pin
#define D_CAL                         0x00000780      // Decode to trim the nominal 17.78mA current source for the High Speed TX drivers on USB_DP and USB_DM


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_RXn register.
//
//*****************************************************************************

#define RXDBYPASS                     0x00400000      // Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver
#define DISCONADJ                     0x000001C0      // The DISCONADJ field adjusts the trip point for the disconnect detector
#define ENVADJ                        0x00000008      // The ENVADJ field adjusts the trip point for the envelope detector


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_CTRLn register.
//
//*****************************************************************************

#define SFTRST                        0x80000000      // Soft-reset the USBPHY_PWD, USBPHY_TX, USBPHY_RX, and USBPHY_CTRL registers
#define CLKGATE                       0x40000000      // Gate UTMI Clocks
#define UTMI_SUSPENDM                 0x20000000      // Indicates a powered-down state
#define HOST_FORCE_LS_SE0             0x10000000      // Forces the next FS packet that is transmitted to have a EOP with low-speed timing
#define OTG_ID_VALUE                  0x08000000      // Indicates the results of USB_ID pin while monitoring the cable plugged into the Micro- or Mini-AB receptacle
#define FSDLL_RST_EN                  0x01000000      // Enables the feature to reset the FSDLL lock detection logic at the end of each TX packet
#define ENAUTOCLR_PHY_PWD             0x00100000      // Enables the feature to auto-clear the PWD register bits in USBPHY_PWD if there is wakeup event while USB is suspended
#define ENAUTOCLR_CLKGATE             0x00080000      // Enables the feature to auto-clear the CLKGATE bit if there is wakeup event while USB is suspended
#define AUTORESUME_EN                 0x00040000      // Enable the auto resume feature
#define ENUTMILEVEL3                  0x00008000      // Enables UTMI+ Level 3 operation for the USB HS PHY
#define ENUTMILEVEL2                  0x00004000      // Enables UTMI+ Level 2 operation for the USB HS PHY
#define DEVPLUGIN_IRQ                 0x00001000      // Indicates that the device is connected
#define ENDEVPLUGINDET                0x00000010      // Enables non-standard resistive plugged-in detection
#define HOSTDISCONDETECT_IRQ          0x00000008      // Indicates that the device has disconnected in High-Speed mode
#define ENHOSTDISCONDETECT            0x00000002      // Enables high-speed disconnect detector


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_STATUS register.
//
//*****************************************************************************

